xml/Enums/ИИА_ТипДиалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ИИА_ТипДиалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Агент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспознаваниеДокументов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Enums/ИИА_АвторСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИИА_АвторСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Система</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Enums/ИИА_ТипСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ИИА_ТипСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/CommonForms/ИИА_Агент/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Устанавливаем начальные значения
	ТекущийТипДиалога = Перечисления.ИИА_ТипДиалога.Агент;
	СтрокаСтатуса = "Готов к работе";
	ОркестраторРаботает = Ложь;
	Элементы.Отправить.Заголовок = "Отправить";
	ЛогСсылка = "Лог";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Проверяем наличие настроек
	Если НЕ ЕстьНастройкиНаСервере() Тогда
		// Если настроек нет, открываем форму регистрации
		ОткрытьФорму("ОбщаяФорма.ИИА_РегистрацияGitsell");
		// Закрываем текущую форму агента, так как без настроек работать нельзя
		ЭтаФорма.Закрыть();
		Возврат;
	КонецЕсли;
	
	// Получаем или создаем диалог текущего пользователя
	ТекущийДиалог = ИИА_Клиент.НайтиИлиСоздатьДиалогПользователя();
	
	// Загружаем сообщения
	ОбновитьСообщения();
	
	// Загружаем план, если есть
	ОбновитьПланНаФорме();
	
КонецПроцедуры

&НаСервере
Функция ЕстьНастройкиНаСервере()
	Возврат ИИА_Сервер.ЕстьНастройкиПользователя();
КонецФункции

#КонецОбласти
&НаКлиенте
Процедура ЛогСсылкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТекущийДиалог = Неопределено ИЛИ ТекущийДиалог.Пустая() Тогда
		Сообщить("Диалог не выбран.");
		Возврат;
	КонецЕсли;
	
	// Принудительно загружаем актуальный лог из справочника
	ТекстЛога = ИИА_ВызовСервера.ПолучитьЛогДиалога(ТекущийДиалог);
	
	// Если лог пустой, проверим, может это новый диалог без лога или ошибка
	Если ПустаяСтрока(ТекстЛога) Тогда
		ОписаниеДиалога = ИИА_ВызовСервера.ПолучитьОписаниеДиалога(ТекущийДиалог);
		Сообщить("Лог диалога пуст. Текущий диалог: " + Строка(ТекущийДиалог.УникальныйИдентификатор()) + " | " + ОписаниеДиалога);
		Возврат;
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ТекстЛога);
	ТекстовыйДокумент.Показать("Лог диалога: " + Строка(ТекущийДиалог));
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийДиалогПриИзменении(Элемент)
	
	// Если диалог пустой, очищаем все
	Если ТекущийДиалог.Пустая() Тогда
		СтрокаСтатуса = "Выберите диалог";
		// Обновляем с пустым диалогом (очистит чат)
		ОбновитьСообщения();
		ОбновитьПланНаФорме();
		Возврат;
	КонецЕсли;
	
	// Останавливаем оркестратор при смене диалога, чтобы не смешивать контексты
	Если ОркестраторРаботает Тогда
		ОстановитьОркестратор();
	КонецЕсли;
	
	// Обновляем сообщения чата
	ОбновитьСообщения();
	
	// Обновляем план
	ОбновитьПланНаФорме();
	
	СтрокаСтатуса = "Диалог загружен";
	
КонецПроцедуры


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОтправить(Команда)
	
	// Если оркестратор работает, останавливаем его
	Если ОркестраторРаботает Тогда
		ОстановитьОркестратор();
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекущийТекст) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущийДиалог = Неопределено Тогда
		Сообщить("Диалог не создан. Попробуйте перезапустить форму.");
		Возврат;
	КонецЕсли;
	
	// Запускаем оркестратор
	ЗапуститьОркестратор();
	
	// Сбрасываем результат старой проверки, если мы начинаем новую задачу
	ИИА_ВызовСервера.СброситьРезультатПроверки(ТекущийДиалог);
	
	// Устанавливаем статус "Отправка..."
	СтрокаСтатуса = "Отправка сообщения...";
	
	Попытка
		
		// Логируем запрос пользователя
		ДобавитьВЛог("Запрос пользователя", ТекущийТекст, Новый Структура("ТипСообщения", ТекущийТипДиалога));
		
		// Отправляем сообщение
		Результат = ИИА_Клиент.ОтправитьСообщение(
			ТекущийДиалог,
			ТекущийТипДиалога,
			ТекущийТекст
		);
		
		// Логируем ответ ИИ
		Если Результат <> Неопределено Тогда
			
			// Добавляем промпт в лог, если он есть (до ответа)
			ДобавитьПромптВЛог(Результат);
			
			ДанныеОтвета = Новый Структура;
			Если Результат.Свойство("ТипОтвета") Тогда
				ДанныеОтвета.Вставить("ТипОтвета", Результат.ТипОтвета);
			КонецЕсли;
			
			ТекстОтвета = "";
			Если Результат.Свойство("Текст") Тогда
				ТекстОтвета = Строка(Результат.Текст);
			КонецЕсли;
			
			// Всегда логируем ответ, чтобы видеть, что пришло
			Если ПустаяСтрока(ТекстОтвета) Тогда
				ДобавитьВЛог("Ответ ИИ", "[Пустой текст ответа]", ДанныеОтвета);
			Иначе
				ДобавитьВЛог("Ответ ИИ", ТекстОтвета, ДанныеОтвета);
			КонецЕсли;
				
				Если НЕ ПустаяСтрока(ТекстОтвета) Тогда
					// Hard DSL mode: запрещено извлекать и выполнять DSL из произвольного текста.
					// Если модель вернула не-DSL, сервер должен вернуть ТипОтвета="ОшибкаКонтракта".
					Если Результат.ТипОтвета = "Текст"
						И Результат.Свойство("Промпт") // признак, что это реальный ответ провайдера/модели
						И (НЕ Результат.Свойство("DSL") ИЛИ ПустаяСтрока(Результат.DSL)) Тогда
						ДобавитьВЛог("Ошибка", "Нарушение контракта: получен текстовый ответ без DSL. В hard-режиме это не выполняется.", Новый Структура("ТипОтвета,Текст", Результат.ТипОтвета, ТекстОтвета));
					КонецЕсли;
				КонецЕсли;
				
				Если Результат.Свойство("DSL") И НЕ ПустаяСтрока(Результат.DSL) Тогда
					ДобавитьВЛог("DSL-сценарий от ИИ", Результат.DSL, ДанныеОтвета);
				КонецЕсли;
			Если Результат.Свойство("Usage") И Результат.Usage <> Неопределено Тогда
				ДанныеUsage = Новый Структура;
				Если Результат.Usage.Свойство("TotalTokens") Тогда
					ДанныеUsage.Вставить("TotalTokens", Результат.Usage.TotalTokens);
				КонецЕсли;
				Если Результат.Usage.Свойство("ОстатокКредитов") Тогда
					ДанныеUsage.Вставить("ОстатокКредитов", Результат.Usage.ОстатокКредитов);
				КонецЕсли;
				ДобавитьВЛог("Использование токенов", "", ДанныеUsage);
			КонецЕсли;
			
			// Логируем результат DSL, если он есть
			Если Результат.Свойство("РезультатDSL") И Результат.РезультатDSL <> Неопределено Тогда
				РезультатDSL = Результат.РезультатDSL;
				ДанныеDSL = Новый Структура;
				ДанныеDSL.Вставить("Успех", РезультатDSL.Успех);
				Если НЕ РезультатDSL.Успех Тогда
					ДанныеDSL.Вставить("Ошибка", РезультатDSL.Сообщение);
				КонецЕсли;
				Если РезультатDSL.Свойство("СсылкиОбъектов") И РезультатDSL.СсылкиОбъектов.Количество() > 0 Тогда
					ДанныеDSL.Вставить("КоличествоОбъектов", РезультатDSL.СсылкиОбъектов.Количество());
				КонецЕсли;
				ДобавитьВЛог("Результат выполнения DSL", РезультатDSL.Сообщение, ДанныеDSL);
				
				// Если есть данные запроса для создания табличного документа, создаем и открываем его
				ДанныеДляТаблицы = Неопределено;
				ОткрытьТабличныйДокумент = Ложь;
				
				Если РезультатDSL.Свойство("ОткрытьТабличныйДокумент") И РезультатDSL.ОткрытьТабличныйДокумент Тогда
					ОткрытьТабличныйДокумент = Истина;
				КонецЕсли;
				
				// Пробуем получить данные из разных мест
				Если РезультатDSL.Свойство("ДанныеЗапроса") И РезультатDSL.ДанныеЗапроса <> Неопределено Тогда
					ДанныеДляТаблицы = РезультатDSL.ДанныеЗапроса;
					ОткрытьТабличныйДокумент = Истина;
				ИначеЕсли РезультатDSL.Свойство("ДанныеЗапросаДляТаблицы") И РезультатDSL.ДанныеЗапросаДляТаблицы <> Неопределено Тогда
					ДанныеДляТаблицы = РезультатDSL.ДанныеЗапросаДляТаблицы;
					ОткрытьТабличныйДокумент = Истина;
				КонецЕсли;
				
				Если ОткрытьТабличныйДокумент И ДанныеДляТаблицы <> Неопределено Тогда
					СоздатьИОткрытьТабличныйДокумент(ДанныеДляТаблицы);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Обновляем список сообщений
		ОбновитьСообщения();
		
		// Запускаем планирование следующих шагов
		ПодключитьОбработчикПланирования();
		
		// Обновляем статус по usage
		Если Результат <> Неопределено Тогда
			Если Результат.Свойство("Usage") И Результат.Usage <> Неопределено Тогда
				Если Результат.Usage.Свойство("ОстатокКредитов") И Результат.Usage.ОстатокКредитов > 0 Тогда
					СтрокаСтатуса = "Осталось " + Формат(Результат.Usage.ОстатокКредитов, "ЧН=0; ЧГ=") + " credits";
				ИначеЕсли Результат.Usage.Свойство("TotalTokens") Тогда
					СтрокаСтатуса = "Токенов использовано: " + Формат(Результат.Usage.TotalTokens, "ЧН=0; ЧГ=");
				Иначе
					СтрокаСтатуса = "Сообщение отправлено";
				КонецЕсли;
			Иначе
				СтрокаСтатуса = "Сообщение отправлено";
			КонецЕсли;
		Иначе
			СтрокаСтатуса = "Ошибка: Сервер вернул Неопределено";
			ДобавитьВЛог("Ошибка", "Сервер вернул пустой результат (Неопределено) после отправки сообщения.");
		КонецЕсли;
		
		// Очищаем поле ввода
		ТекущийТекст = "";
		
	Исключение
		
		СтрокаСтатуса = "Ошибка: " + ОписаниеОшибки();
		ДобавитьВЛог("Ошибка", "Исключение при отправке сообщения: " + ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьЗапрос(Команда)
	
	// Функционал временно недоступен из-за смены интерфейса
	Сообщить("Функция проверки запроса временно недоступна в новом интерфейсе.");
	
	КонецПроцедуры

&НаКлиенте
Процедура КомандаСкопировать(Команда)
	
	// Функционал временно недоступен из-за смены интерфейса
	Сообщить("Функция копирования временно недоступна в новом интерфейсе.");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНастройки(Команда)
	
	// Открываем форму настроек пользователя
	Сообщить("Настройки (в разработке)");
	
КонецПроцедуры


&НаКлиенте
Процедура ТестDSL(Команда)
	
	Если ПустаяСтрока(ТестDSL) Тогда
		Сообщить("Введите DSL-сценарий в поле 'Тест DSL'");
		Возврат;
	КонецЕсли;
	
	Если ТекущийДиалог = Неопределено Тогда
		Сообщить("Диалог не создан. Попробуйте перезапустить форму.");
		Возврат;
	КонецЕсли;
	
	// Устанавливаем статус
	СтрокаСтатуса = "Выполнение DSL-сценария...";
	
	Попытка
		
		// Выполняем DSL на сервере (сообщения добавляются автоматически на сервере)
		Результат = ИИА_Клиент.ВыполнитьDSLСценарий(ТекущийДиалог, ТестDSL);
		
		// Обновляем статус в зависимости от результата
		Если Результат.Успех Тогда
			СтрокаСтатуса = "DSL-сценарий выполнен успешно";
		Иначе
			СтрокаСтатуса = "Ошибка выполнения DSL: " + Результат.Сообщение;
		КонецЕсли;
		
		// Обновляем список сообщений (чтобы увидеть системные сообщения, добавленные на сервере)
		ОбновитьСообщения();
		
	Исключение
		
		СтрокаСтатуса = "Ошибка: " + ОписаниеОшибки();
		Сообщить("Ошибка при выполнении DSL: " + ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйДиалог(Команда)
	
	// Деактивируем текущий диалог (если есть)
	Если ТекущийДиалог <> Неопределено Тогда
		ИИА_ВызовСервера.ДеактивироватьДиалог(ТекущийДиалог);
	КонецЕсли;
	
	// Создаем новый диалог
	ТекущийДиалог = ИИА_Клиент.СоздатьНовыйДиалог();
	
	// Очищаем форму
	ТекущийТекст = "";
	
	// Обновляем сообщения
	ОбновитьСообщения();
	
	// Обновляем план
	ОбновитьПланНаФорме();
	
	// Устанавливаем начальные значения
	СтрокаСтатуса = "Создан новый диалог. Готов к работе";
	ОркестраторРаботает = Ложь;
	Элементы.Отправить.Заголовок = "Отправить";
	
	ДобавитьВЛог("Система", "Создан новый диалог");
	
КонецПроцедуры
#КонецОбласти

#Область ПроцедурыИФункцииКлиентскогоМодуля

&НаКлиенте
// Запускает оркестратор и обновляет интерфейс
Процедура ЗапуститьОркестратор()
	
	ОркестраторРаботает = Истина;
	Элементы.Отправить.Заголовок = "Остановить";
	Элементы.Отправить.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Останавливает оркестратор и обновляет интерфейс
Процедура ОстановитьОркестратор()
	
	ОркестраторРаботает = Ложь;
	ОтключитьОбработчикОжидания("СпланироватьСледующиеШаги");
	Элементы.Отправить.Заголовок = "Отправить";
	СтрокаСтатуса = "Оркестратор остановлен";
	ДобавитьВЛог("Система", "Оркестратор остановлен");
	
КонецПроцедуры

&НаКлиенте
// Подключает обработчик ожидания для планирования следующих шагов
Процедура ПодключитьОбработчикПланирования()
	ПодключитьОбработчикОжидания("СпланироватьСледующиеШаги", 2, Истина); // Выполнить один раз через 2 сек
КонецПроцедуры

&НаКлиенте
// Оркестратор процесса выполнения задачи с использованием планирования
Процедура СпланироватьСледующиеШаги()
	
	Если ТекущийДиалог = Неопределено ИЛИ ТекущийДиалог.Пустая() Тогда
		Возврат;
	КонецЕсли;

	// Проверяем, остановлен ли оркестратор
	Если НЕ ОркестраторРаботает Тогда
		Возврат;
	КонецЕсли;

	// 1. Проверка лимита токенов
	Настройки = ИИА_ВызовСервера.ПолучитьНастройкиПользователя(ИИА_Клиент.ТекущийПользователь());
	МаксимальноеКоличествоТокенов = ?(Настройки.Свойство("ЛимитТокеновНаДиалог") И Настройки.ЛимитТокеновНаДиалог > 0, Настройки.ЛимитТокеновНаДиалог, 10000);

	ОбщееКоличествоТокенов = ИИА_ВызовСервера.ПолучитьОбщееКоличествоТокенов(ТекущийДиалог);
	Если ОбщееКоличествоТокенов >= МаксимальноеКоличествоТокенов Тогда
		ОстановитьОркестратор();
		СтрокаСтатуса = "Достигнут лимит токенов. Остановка.";
		ДобавитьВЛог("Система", "Достигнут лимит токенов. Остановка обработки.", Новый Структура("Токенов", ОбщееКоличествоТокенов, "Лимит", МаксимальноеКоличествоТокенов));
		ОбновитьСообщения();
		Возврат;
	КонецЕсли;

	// 2. Инициализация плана, если его нет
	ПланЗавершен = ИИА_ВызовСервера.ПланЗавершен(ТекущийДиалог);
	ПланДанные = ИИА_ВызовСервера.ПолучитьПланДиалога(ТекущийДиалог);
	
	Если ПланДанные.Количество() = 0 Тогда
		СтрокаСтатуса = "Создание плана выполнения...";
		УспехПланирования = ИИА_ВызовСервера.ИнициализироватьПлан(ТекущийДиалог);
		ОбновитьПланНаФорме();
		Если УспехПланирования Тогда
			ПодключитьОбработчикПланирования();
		Иначе
			СтрокаСтатуса = "Ошибка создания плана";
			ОстановитьОркестратор();
		КонецЕсли;
		Возврат;
	КонецЕсли;

	// 3. (Удалено: Обновление плана теперь происходит внутри СгенерироватьПродолжениеВыполнения одним запросом)
	
	// 4. Проверяем, завершен ли план
	Если ИИА_ВызовСервера.ПланЗавершен(ТекущийДиалог) Тогда
		
		СтрокаСтатуса = "Финальная проверка...";
		РезультатПроверки = ИИА_ВызовСервера.ПроверитьРезультатВыполненияЗадачи(ТекущийДиалог);
		
		ИИА_ВызовСервера.УстановитьРезультатПроверки(ТекущийДиалог, РезультатПроверки.ПроверкаВыполнена, РезультатПроверки.Причина);
		СгенерироватьИДобавитьSummary(ТекущийДиалог, РезультатПроверки.Причина);
		
		Если РезультатПроверки.ПроверкаВыполнена Тогда
			СтрокаСтатуса = "Задача выполнена успешно";
			ОстановитьОркестратор();
		Иначе
			СтрокаСтатуса = "План завершен, но задача не подтверждена";
			ОстановитьОркестратор();
		КонецЕсли;
		
		ОбновитьСообщения();
		Возврат;
		
	КонецЕсли;

	// 5. Генерируем следующий шаг на основе плана
	СтрокаСтатуса = "Обновление плана и генерация следующего шага...";
	ИИА_ВызовСервера.СгенерироватьПродолжениеВыполнения(ТекущийДиалог);
	
	ОбновитьПланНаФорме();
	ОбновитьСообщения();
	ПодключитьОбработчикПланирования();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПланНаФорме()
	ОбновитьПланНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПланНаСервере()
	
	Если ТекущийДиалог = Неопределено ИЛИ ТекущийДиалог.Пустая() Тогда
		ЭтотОбъект.ПланЗадач.Очистить();
		Возврат;
	КонецЕсли;
	
	ПланДанные = ИИА_Сервер.ПолучитьПланДиалога(ТекущийДиалог);
	
	// Предполагаем, что на форме есть таблица ПланЗадач, 
	// связанная с реквизитом типа ТаблицаЗначений (или ТабличнаяЧасть)
	ЭтотОбъект.ПланЗадач.Очистить();
	Для Каждого СтрокаПлана Из ПланДанные Цикл
		НоваяСтрока = ЭтотОбъект.ПланЗадач.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПлана);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Обновляет список сообщений на форме
Процедура ОбновитьСообщения()
	
	НовыеСообщения = ИИА_Клиент.ЗагрузитьСообщенияДиалога(ТекущийДиалог);
	
	// Обновляем визуальный интерфейс чата (программно создаем элементы)
	ОбновитьИнтерфейсЧатаНаСервере(НовыеСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнтерфейсЧатаНаСервере(Сообщения)
	
	ИмяГруппыЧата = "ГруппаИсторияЧата";
	
	// 1. Очистка старых элементов и реквизитов
	ОчиститьЧат(ИмяГруппыЧата);
	
	// 2. Подготовка новых реквизитов
	МассивДобавляемыхРеквизитов = Новый Массив;
	МассивТипаСтрока = Новый Массив;
	МассивТипаСтрока.Добавить(Тип("Строка"));
	ОписаниеТипаСтрока = Новый ОписаниеТипов(МассивТипаСтрока);
	
	Для Индекс = 0 По Сообщения.Количество() - 1 Цикл
		СтрокаСообщения = Сообщения[Индекс];
		Префикс = "дин_msg_" + Формат(Индекс, "ЧГ=0");
		
		// Реквизит для текста сообщения
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(Префикс + "_Text", ОписаниеТипаСтрока, "", "Текст сообщения"));
		
		// Если есть код, реквизит для кода
		Если НЕ ПустаяСтрока(СтрокаСообщения.ТекстКода) Тогда
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(Префикс + "_Code", ОписаниеТипаСтрока, "", "Код сообщения"));
		КонецЕсли;
		
		// Реквизит для статуса/заголовка
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(Префикс + "_Header", ОписаниеТипаСтрока, "", "Заголовок"));
	КонецЦикла;
	
	// Изменяем реквизиты формы
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	// 3. Создание элементов и заполнение данными
	ГруппаЧат = Элементы.Найти(ИмяГруппыЧата);
	Если ГруппаЧат = Неопределено Тогда
		// Создаем группу, если её нет
		ГруппаЧат = Элементы.Добавить(ИмяГруппыЧата, Тип("ГруппаФормы"), ЭтотОбъект);
		ГруппаЧат.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаЧат.Заголовок = "История чата";
	КонецЕсли;
	
	// Настраиваем отображение группы (даже если она создана в конфигураторе)
	ГруппаЧат.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаЧат.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	// Выводим сообщения в обратном порядке (последние вверху)
	Для Индекс = 0 По Сообщения.Количество() - 1 Цикл
		// Используем обратный индекс для получения данных сообщения
		ОбратныйИндекс = Сообщения.Количество() - 1 - Индекс;
		СтрокаСообщения = Сообщения[ОбратныйИндекс];
		
		Префикс = "дин_msg_" + Формат(ОбратныйИндекс, "ЧГ=0");
		ИмяГруппыСообщения = Префикс + "_Group";
		
		// Данные для реквизитов
		ЭтотОбъект[Префикс + "_Text"] = СтрокаСообщения.Текст;
		Если НЕ ПустаяСтрока(СтрокаСообщения.ТекстКода) Тогда
			ЭтотОбъект[Префикс + "_Code"] = СтрокаСообщения.ТекстКода;
		КонецЕсли;
		ЭтотОбъект[Префикс + "_Header"] = ПолучитьЗаголовокСообщения(СтрокаСообщения);
		
		// --- Контейнер для выравнивания (строка чата) ---
		ГруппаКонтейнер = Элементы.Добавить(ИмяГруппыСообщения + "_Cont", Тип("ГруппаФормы"), ГруппаЧат);
		ГруппаКонтейнер.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаКонтейнер.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ГруппаКонтейнер.Отображение = ОтображениеОбычнойГруппы.Нет;
		
		ЭтоПользователь = (СтрокаСообщения.Автор = ПредопределенноеЗначение("Перечисление.ИИА_АвторСообщения.Пользователь"));
		
		// --- Распорка слева (для сообщений пользователя) ---
		Если ЭтоПользователь Тогда
			РаспоркаЛ = Элементы.Добавить(ИмяГруппыСообщения + "_SpaceL", Тип("ДекорацияФормы"), ГруппаКонтейнер);
			РаспоркаЛ.Вид = ВидДекорацииФормы.Надпись;
			РаспоркаЛ.РастягиватьПоГоризонтали = Истина;
		КонецЕсли;
		
		// --- Группа самого сообщения (пузырь) ---
		ГруппаПузырь = Элементы.Добавить(ИмяГруппыСообщения, Тип("ГруппаФормы"), ГруппаКонтейнер);
		ГруппаПузырь.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаПузырь.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		
		// Оформление пузыря
		ГруппаПузырь.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение; // Рамка
		
		// --- Заголовок (Автор, Время) ---
		ЗаголовокЭлемент = Элементы.Добавить(ИмяГруппыСообщения + "_Header", Тип("ПолеФормы"), ГруппаПузырь);
		ЗаголовокЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		ЗаголовокЭлемент.ПутьКДанным = Префикс + "_Header";
		ЗаголовокЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЗаголовокЭлемент.Шрифт = Новый Шрифт(,, Истина); // Жирный
		ЗаголовокЭлемент.ЦветТекста = WebЦвета.Серый;
		
		// --- Текст сообщения ---
		ТекстЭлемент = Элементы.Добавить(ИмяГруппыСообщения + "_Text", Тип("ПолеФормы"), ГруппаПузырь);
		ТекстЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		ТекстЭлемент.ПутьКДанным = Префикс + "_Text";
		ТекстЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ТекстЭлемент.МногострочныйРежим = Истина;
		ТекстЭлемент.ТолькоПросмотр = Истина;
		ТекстЭлемент.РастягиватьПоГоризонтали = Истина;
		ТекстЭлемент.АвтоМаксимальнаяВысота = 0;
		ТекстЭлемент.Высота = 0;
		ТекстЭлемент.ЦветРамки = WebЦвета.Белый;
		ТекстЭлемент.ЦветФона = WebЦвета.Белый;
		
		// --- Блок кода (если есть) ---
		Если НЕ ПустаяСтрока(СтрокаСообщения.ТекстКода) Тогда
			КодЭлемент = Элементы.Добавить(ИмяГруппыСообщения + "_Code", Тип("ПолеФормы"), ГруппаПузырь);
			КодЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			КодЭлемент.ПутьКДанным = Префикс + "_Code";
			КодЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			КодЭлемент.МногострочныйРежим = Истина;
			КодЭлемент.ТолькоПросмотр = Истина;
			КодЭлемент.Шрифт = Новый Шрифт("Courier New", 10);
			КодЭлемент.ЦветФона = Новый Цвет(245, 245, 245);
			КодЭлемент.РастягиватьПоГоризонтали = Истина;
		КонецЕсли;
		
		// --- Распорка справа (для сообщений ИИ) ---
		Если НЕ ЭтоПользователь Тогда
			РаспоркаП = Элементы.Добавить(ИмяГруппыСообщения + "_SpaceR", Тип("ДекорацияФормы"), ГруппаКонтейнер);
			РаспоркаП.Вид = ВидДекорацииФормы.Надпись;
			РаспоркаП.РастягиватьПоГоризонтали = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	// Прокручиваем к последнему сообщению
	Количество = Сообщения.Количество();
	Если Количество > 0 Тогда
		ПоследнийИндекс = Количество - 1;
		ИмяЭлемента = "дин_msg_" + Формат(ПоследнийИндекс, "ЧГ=0") + "_Group";
		Элемент = Элементы.Найти(ИмяЭлемента);
		Если Элемент <> Неопределено Тогда
			ТекущийЭлемент = Элемент;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЧат(ИмяГруппыЧата)
	
	// 1. Удаление элементов
	ГруппаЧат = Элементы.Найти(ИмяГруппыЧата);
	Если ГруппаЧат <> Неопределено Тогда
		МассивДляУдаления = Новый Массив;
		Для Каждого ПодчиненныйЭлемент Из ГруппаЧат.ПодчиненныеЭлементы Цикл
			Если СтрНачинаетсяС(ПодчиненныйЭлемент.Имя, "дин_") Тогда
				МассивДляУдаления.Добавить(ПодчиненныйЭлемент);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ЭлементУдаления Из МассивДляУдаления Цикл
			Элементы.Удалить(ЭлементУдаления);
		КонецЦикла;
	КонецЕсли;
	
	// 2. Удаление динамических реквизитов (дин_...)
	МассивУдаляемыхРеквизитов = Новый Массив;
	ВсеРеквизиты = ПолучитьРеквизиты();
	
	Для Каждого Реквизит Из ВсеРеквизиты Цикл
		Если Лев(Реквизит.Имя, 4) = "дин_" Тогда
			МассивУдаляемыхРеквизитов.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивУдаляемыхРеквизитов.Количество() > 0 Тогда
		ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьЗаголовокСообщения(СтрокаСообщения)
	
	Заголовок = Строка(СтрокаСообщения.Автор);
	
	Если ЗначениеЗаполнено(СтрокаСообщения.Время) Тогда
		Заголовок = Заголовок + " [" + Формат(СтрокаСообщения.Время, "ДФ=HH:mm") + "]";
	КонецЕсли;
	
	Если СтрокаСообщения.ТипСообщения = ПредопределенноеЗначение("Перечисление.ИИА_ТипСообщения.Ошибка") Тогда
		Заголовок = Заголовок + " (Ошибка)";
	КонецЕсли;
	
	Возврат Заголовок;
	
КонецФункции

&НаКлиенте
Процедура КомандаВверх(Команда)
	
	// Прокрутка к ВЕРХУ формы (к последним сообщениям)
	СообщенияЧат = ИИА_Клиент.ЗагрузитьСообщенияДиалога(ТекущийДиалог);
	Количество = СообщенияЧат.Количество();

	Если Количество > 0 Тогда
		Индекс = Количество - 1;
		ИмяЭлемента = "дин_msg_" + Формат(Индекс, "ЧГ=0") + "_Group";
		Элемент = Элементы.Найти(ИмяЭлемента);
		Если Элемент <> Неопределено Тогда
			ТекущийЭлемент = Элемент;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВниз(Команда)
	
	Элемент = Элементы.Найти("дин_msg_0_Group");
	Если Элемент <> Неопределено Тогда
		ТекущийЭлемент = Элемент;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВЛог(ТипСобытия, Текст, ДополнительныеДанные = Неопределено)
	
	ВремяСобытия = ТекущаяДата();
	ВремяСтрока = Формат(ВремяСобытия, "ДФ=dd.MM.yyyy HH:mm:ss");
	
	ЗаписьЛога = "[" + ВремяСтрока + "] [" + ТипСобытия + "]" + Символы.ПС + Текст;
	
	Если ДополнительныеДанные <> Неопределено Тогда
		Для Каждого КлючЗначение Из ДополнительныеДанные Цикл
			ЗаписьЛога = ЗаписьЛога + Символы.ПС + "  " + КлючЗначение.Ключ + ": " + Строка(КлючЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ЗаписьЛога = ЗаписьЛога + Символы.ПС + Символы.ПС + "---" + Символы.ПС;
	
	Если ТекущийДиалог <> Неопределено Тогда
		ИИА_ВызовСервера.ДобавитьЗаписьВЛогДиалога(ТекущийДиалог, ЗаписьЛога);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПромптВЛог(Результат)
	
	Если Результат <> Неопределено И Результат.Свойство("Промпт") И НЕ ПустаяСтрока(Результат.Промпт) Тогда
		ДобавитьВЛог("Промпт ИИ", Результат.Промпт);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьИДобавитьSummary(СсылкаДиалога, Причина)

	Попытка
		
		ТекстSummary = ИИА_ВызовСервера.СгенерироватьSummary(СсылкаДиалога);
		
		Если ПустаяСтрока(ТекстSummary) Тогда
			ДобавитьВЛог("Ошибка", "Не удалось сгенерировать резюме");
			Возврат;
		КонецЕсли;
		
		Дополнение = "";
		Если НЕ ПустаяСтрока(Причина) Тогда
			Дополнение = Символы.ПС + Символы.ПС + "Проверка: " + Причина;
		КонецЕсли;
		
		ТекстSummary = ТекстSummary + Дополнение;
		
		ИИА_ВызовСервера.ДобавитьСистемноеСообщениеНаСервере(
			СсылкаДиалога,
			"=== РЕЗЮМЕ ВЫПОЛНЕННОЙ РАБОТЫ ===" + Символы.ПС + Символы.ПС + ТекстSummary,
			ПредопределенноеЗначение("Перечисление.ИИА_ТипСообщения.Текст")
		);
		
		ДобавитьВЛог("Система", "Резюме сгенерировано и сохранено в диалог", Новый Структура(
			"Причина", ?(ПустаяСтрока(Причина), "не указана", Причина)
		));
		
	Исключение
		ДобавитьВЛог("Ошибка", "Ошибка при генерации резюме: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИОткрытьТабличныйДокумент(ДанныеЗапроса)
	
	Если ДанныеЗапроса = Неопределено Или ТипЗнч(ДанныеЗапроса) <> Тип("Массив") Или ДанныеЗапроса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ТабличныйДокумент = ИИА_ВызовСервера.СоздатьТабличныйДокументИзДанных(ДанныеЗапроса);
		
		Если ТабличныйДокумент <> Неопределено Тогда
			ТабличныйДокумент.Показать();
			
			// Сообщаем серверу, что таблица была показана
			Если ЗначениеЗаполнено(ТекущийДиалог) Тогда
				ИИА_ВызовСервера.УстановитьФлагТаблицыВХранилище(ТекущийДиалог, Истина);
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		Сообщить("Ошибка при создании табличного документа: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Настройка(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ИИА_Настройки");
	
КонецПроцедуры

#КонецОбласти
